# pandas

In [1]:
import pandas as pd

* series ------------- 1d array
* data frame---------- 2d array(table format,row and columns)

In [2]:
a = pd.Series([])
b = pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\DELL\AppData\Local\Temp\ipykernel_14168\1746593775.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [3]:
print(type(a))
print(type(b))
print(type(c))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [7]:
import numpy as np

In [8]:
n=np.array([1,2,3,4,40])

In [9]:
n

array([ 1,  2,  3,  4, 40])

In [10]:
x=pd.Series(n)

In [11]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [12]:
type(a)

pandas.core.series.Series

In [13]:
type(n)

numpy.ndarray

In [14]:
type(x)

pandas.core.series.Series

In [15]:
l = pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [16]:
l

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [17]:
l[0]

1

In [18]:
l[4]

[12, 23]

In [19]:
l[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [20]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [21]:
d['d']

99

In [22]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [23]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [24]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [25]:
s=pd.Series([12,52,42,10,23],index=list('qwert'))

In [26]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [27]:
s2=pd.Series([12,52,12,52,10,23,42,10,23])

In [28]:
s2

0    12
1    52
2    12
3    52
4    10
5    23
6    42
7    10
8    23
dtype: int64

In [29]:
s2.value_counts()   ###for counting the same number present in the list

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [30]:
s2.argmax()

1

In [31]:
s2.argmin()

4

In [32]:
s.idxmax()

'w'

In [33]:
s.idxmin()

'r'

# DataFrame

In [34]:
a=pd.DataFrame()  ###empty data frame

In [35]:
b=pd.DataFrame([1,2,55,40,86])

In [36]:
a

Empty DataFrame
Columns: []
Index: []

In [37]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [38]:
type(b)

pandas.core.frame.DataFrame

In [39]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [40]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [41]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [42]:
c1=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9],[1,2,3],[10,20,30],[7,8,9],[1,2,3],[10,20,30],[7,8,9],[1,2,3],[10,20,30],[7,8,9]])

In [43]:
c1

     0   1   2
0    1   2   3
1   10  20  30
2    7   8   9
3    1   2   3
4   10  20  30
5    7   8   9
6    1   2   3
7   10  20  30
8    7   8   9
9    1   2   3
10  10  20  30
11   7   8   9

In [44]:
c1.head()

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9
3   1   2   3
4  10  20  30

In [45]:
c1.tail()

     0   1   2
7   10  20  30
8    7   8   9
9    1   2   3
10  10  20  30
11   7   8   9

In [46]:
c1.head(1)

   0  1  2
0  1  2  3

In [47]:
c1.tail(1)

    0  1  2
11  7  8  9

In [48]:
c1.sample(5)

     0   1   2
5    7   8   9
0    1   2   3
3    1   2   3
11   7   8   9
4   10  20  30

In [49]:
c2=pd.DataFrame([[1,2,3],[10,20,'a'],[7,8,9],[1,2,3],[10,30],[7,8,9],[1,2],[10,20,30],[7,8,9],[1,2,3],[10,20,30],[7,8,9]])

In [50]:
c2

     0   1     2
0    1   2     3
1   10  20     a
2    7   8     9
3    1   2     3
4   10  30  None
5    7   8     9
6    1   2  None
7   10  20    30
8    7   8     9
9    1   2     3
10  10  20    30
11   7   8     9

In [51]:
c3=pd.DataFrame([[1,2,3],[10,20],[7,8,9],[1,2,3],[10,30],[7,8,9],[1,2],[10,20,30],[7,8,9],[1,2,3],[10,20,30],[7,8,9]])

In [52]:
c3

     0   1     2
0    1   2   3.0
1   10  20   NaN
2    7   8   9.0
3    1   2   3.0
4   10  30   NaN
5    7   8   9.0
6    1   2   NaN
7   10  20  30.0
8    7   8   9.0
9    1   2   3.0
10  10  20  30.0
11   7   8   9.0

In [53]:
c4=pd.DataFrame([[1,2,3],[np.nan,10,20],[7,8,9],[1,2,3],[10,30],[7,8,9],[1,2],[10,20,30],[7,8,9],[1,2,3],[10,20,30],[7,8,9]])

In [54]:
c4

       0   1     2
0    1.0   2   3.0
1    NaN  10  20.0
2    7.0   8   9.0
3    1.0   2   3.0
4   10.0  30   NaN
5    7.0   8   9.0
6    1.0   2   NaN
7   10.0  20  30.0
8    7.0   8   9.0
9    1.0   2   3.0
10  10.0  20  30.0
11   7.0   8   9.0

In [55]:
c5=pd.DataFrame([[1,2,3],[10,20],[7,8,9],[1,2,3],[np.nan,30,'miss'],[7,8,9],[1,2],[10,20,30],[7,8,9],[1,2,3],[10,20,30],[7,8,9]])

In [56]:
c5

       0   1     2
0    1.0   2     3
1   10.0  20  None
2    7.0   8     9
3    1.0   2     3
4    NaN  30  miss
5    7.0   8     9
6    1.0   2  None
7   10.0  20    30
8    7.0   8     9
9    1.0   2     3
10  10.0  20    30
11   7.0   8     9

In [57]:
c6=pd.DataFrame([[1,2,3],[10,20],[7,8,9],[1,2,3]],columns=['cola','lola','dola'])

In [58]:
c6

   cola  lola  dola
0     1     2   3.0
1    10    20   NaN
2     7     8   9.0
3     1     2   3.0

In [59]:
c6['cola']

0     1
1    10
2     7
3     1
Name: cola, dtype: int64

In [60]:
c6[['cola','lola']]

   cola  lola
0     1     2
1    10    20
2     7     8
3     1     2

In [61]:
c6[['cola','lola']][0:3]

   cola  lola
0     1     2
1    10    20
2     7     8

In [62]:
c6.shape

(4, 3)

In [63]:
c6['cola'].max()

10

In [64]:
c6

   cola  lola  dola
0     1     2   3.0
1    10    20   NaN
2     7     8   9.0
3     1     2   3.0

In [65]:
c6['asshola']=[12,33,44,33]

In [66]:
c6

   cola  lola  dola  asshola
0     1     2   3.0       12
1    10    20   NaN       33
2     7     8   9.0       44
3     1     2   3.0       33

In [67]:
c6['cola']=c6['lola']*c6['dola']

In [73]:
c6   # nan not a number

   cola  lola  dola  asshola
0   6.0     2   3.0       12
1   NaN    20   NaN       33
2  72.0     8   9.0       44
3   6.0     2   3.0       33

In [69]:
c6['asshola']>50

0    False
1    False
2    False
3    False
Name: asshola, dtype: bool

In [70]:
f=c6['asshola']>23

In [71]:
c6[f]['asshola']

1    33
2    44
3    33
Name: asshola, dtype: int64

In [ ]:
;